const products = [
    {
        name: "accuretic",
        description: "أكورتيك هو دواء يُستخدم لعلاج ارتفاع ضغط الدم، حيث يعمل على توسيع الأوعية الدموية وتحسين تدفق الدم في الجسم. يحتوي على مزيج من المواد الفعالة التي تساعد في التحكم بضغط الدم بشكل فعال وتقليل احتباس السوائل، مما يقلل من العبء على القلب والكلى. يُنصح باستخدامه للأشخاص الذين يعانون من ارتفاع ضغط الدم المزمن للحد من مضاعفات أمراض القلب والسكتة الدماغية. يعمل الدواء بسرعة ويستمر تأثيره لفترات طويلة، مما يجعله خيارًا مثاليًا للتحكم المستمر في ضغط الدم. يُفضل تناوله تحت إشراف طبي لضمان الجرعة المناسبة وتجنب أي آثار جانبية محتملة.",
        specifications: "1. يستخدم لعلاج ارتفاع ضغط الدم عن طريق تثبيط إنزيم معين مما يؤدي إلى استرخاء الأوعية الدموية وتسهيل تدفق الدم.\n2. يساعد في تقليل مخاطر الإصابة بمضاعفات القلب مثل النوبات القلبية والسكتات الدماغية.\n3. يعمل على تقليل الضغط داخل الأوعية الدموية مما يساعد في تحسين كفاءة عمل القلب.\n4. يقلل من احتباس السوائل في الجسم عن طريق تعزيز قدرة الكلى على التخلص من الأملاح والمياه الزائدة.\n5. يساعد في الحماية من الأضرار التي قد تلحق بالكلى بسبب ارتفاع ضغط الدم المزمن.\n6. يُستخدم بشكل أساسي لعلاج مرضى ضغط الدم المرتفع المزمن.",
        dest: "1. يحتوي على كوينابريل، وهو مثبط للإنزيم المحول للأنجيوتنسين الذي يساعد في خفض ضغط الدم عن طريق توسيع الأوعية الدموية.\n2. يحتوي على هيدروكلوروثيازيد، وهو مدر للبول يساعد في تقليل احتباس السوائل مما يساهم في تخفيض ضغط الدم.\n3. يساعد هذا المزيج من المواد الفعالة في التحكم في ضغط الدم بشكل أكثر كفاءة مقارنة باستخدام أي من المكونين بمفرده.\n4. يتم امتصاص الدواء في الجهاز الهضمي ويبدأ مفعوله خلال ساعة من تناوله، ويستمر تأثيره لفترة طويلة نسبيًا.\n5. يعمل على تثبيط إنتاج المواد التي تضيق الأوعية الدموية مما يسهم في توسيعها وتحسين تدفق الدم.\n6. يُساعد في الحد من المضاعفات القلبية المرتبطة بارتفاع ضغط الدم.",
        image: "../image3/accuretic.jpg",
        price: 3200,
    },
    {
        name: "amaryl",
        description: "أماريل هو دواء فعال يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يعمل على تحفيز إفراز الأنسولين من البنكرياس وتحسين استجابة الجسم له. يساهم في تقليل مقاومة الأنسولين وتحسين امتصاص الجلوكوز في الخلايا مما يساعد في التحكم بمستويات السكر في الدم. يُستخدم إلى جانب الحمية الغذائية وممارسة التمارين الرياضية لضبط نسبة السكر بشكل فعال، مما يقلل من خطر حدوث المضاعفات المرتبطة بمرض السكري مثل اعتلال الكلى وأمراض القلب. يُفضل تناوله بناءً على إرشادات الطبيب لتحديد الجرعة المناسبة لكل حالة على حدة.",
        specifications: "1. يساعد في السيطرة على مستويات السكر في الدم من خلال زيادة إفراز الأنسولين من البنكرياس.\n2. يقلل من مقاومة الجسم للأنسولين مما يساعد في تحسين استجابة الخلايا للجلوكوز.\n3. يساهم في تقليل خطر الإصابة بمضاعفات مرض السكري مثل اعتلال الشبكية وأمراض الكلى.\n4. يعمل على تقليل تقلبات مستويات السكر في الدم مما يوفر تحكمًا أكثر استقرارًا.\n5. يمكن استخدامه بمفرده أو مع أدوية أخرى لعلاج السكري لتعزيز فعاليته.\n6. يُساعد في تحسين حساسية الخلايا للأنسولين مما يجعل تأثيره طويل الأمد.",
        dest: "1. يحتوي على جليمبيريد، وهو دواء ينتمي إلى فئة السلفونيل يوريا التي تعمل على تحفيز إفراز الأنسولين.\n2. يعمل الدواء عن طريق تحفيز خلايا بيتا في البنكرياس مما يؤدي إلى إنتاج المزيد من الأنسولين.\n3. يُمتص في الجهاز الهضمي ويبدأ تأثيره خلال ساعتين من تناوله، ويستمر مفعوله لساعات طويلة.\n4. يساعد في تحسين قدرة الخلايا على استخدام الجلوكوز بفعالية أكبر، مما يقلل الحاجة إلى جرعات عالية من الأنسولين.\n5. يعمل على تقليل خطر الإصابة بالمضاعفات القلبية الناتجة عن مرض السكري.\n6. يُساعد في تحسين كفاءة البنكرياس في إفراز الأنسولين بشكل طبيعي.",
        image: "../image3/amaryl.jpg",
        price: 3200,
    },
    {
        name: "amlo5",
        description: "أملو 5 هو دواء يُستخدم لعلاج ارتفاع ضغط الدم وأمراض القلب التاجية، حيث يعمل على توسيع الأوعية الدموية وتحسين تدفق الدم. ينتمي إلى فئة حاصرات قنوات الكالسيوم، مما يساعد في تقليل الضغط على القلب وتحسين أدائه. يستخدم لعلاج الذبحة الصدرية والوقاية منها، كما يُساهم في تخفيف الأعراض المصاحبة لأمراض القلب. يُفضل تناوله بناءً على وصفة طبية لتحديد الجرعة المناسبة لكل حالة وضمان فعاليته دون أي آثار جانبية خطيرة.",
        specifications: "1. يستخدم في علاج ارتفاع ضغط الدم من خلال توسيع الأوعية الدموية وتقليل الحمل على القلب.\n2. يساعد في تخفيف الذبحة الصدرية عن طريق تحسين تدفق الدم إلى القلب.\n3. يعمل على تقليل مخاطر الإصابة بالسكتات الدماغية والنوبات القلبية.\n4. يُستخدم كعلاج طويل الأمد لمرضى القلب والأوعية الدموية.\n5. يعمل على استرخاء العضلات الملساء في الأوعية الدموية مما يؤدي إلى خفض ضغط الدم.\n6. يُقلل من مقاومة الأوعية الدموية الطرفية مما يحسن وظائف القلب بشكل عام.",
        dest: "1. يحتوي على أملوديبين، وهو مادة فعالة تنتمي إلى فئة حاصرات قنوات الكالسيوم.\n2. يعمل على منع دخول الكالسيوم إلى خلايا عضلات القلب والأوعية الدموية مما يؤدي إلى توسعها وتحسين تدفق الدم.\n3. يساعد في تقليل ضغط الدم المرتفع مما يقلل من خطر الإصابة بمضاعفات القلب.\n4. يُساعد في تخفيف الضغط على القلب وتحسين كفاءة عمله.\n5. يُستخدم بمفرده أو مع أدوية أخرى لعلاج أمراض القلب وارتفاع ضغط الدم.\n6. يبدأ تأثيره خلال ساعات قليلة من تناوله ويستمر لفترة طويلة، مما يجعله خيارًا فعالًا للعلاج المستمر.",
        image: "../image3/amlo5.jpg",
        price: 3200,
    },
    {
        name: "capoten",
        description: "كابوتين هو دواء يُستخدم لعلاج ارتفاع ضغط الدم وقصور القلب. يعمل على توسيع الأوعية الدموية مما يسهل تدفق الدم ويقلل من الضغط على القلب. يُستخدم أيضًا في حالات الفشل الكلوي الناتج عن السكري.",
        specifications: "1. يساعد في خفض ضغط الدم عن طريق توسيع الأوعية الدموية.\n2. يقلل من عبء العمل على القلب مما يحسن من كفاءته.\n3. يُستخدم لعلاج قصور القلب وتحسين تدفق الدم إلى الأعضاء الحيوية.\n4. يساعد في حماية الكلى لدى مرضى السكري.\n5. يمكن استخدامه بمفرده أو مع أدوية أخرى لضبط ضغط الدم.",
        dest: "1. يحتوي على كابتوبريل، وهو مثبط للإنزيم المحول للأنجيوتنسين (ACE inhibitor).\n2. يساعد في تقليل إنتاج المواد التي تضيق الأوعية الدموية.\n3. يعمل بسرعة ويبدأ مفعوله خلال 15-30 دقيقة من تناوله.\n4. يعزز من قدرة القلب على ضخ الدم بفعالية أكبر.",
        image: "../image3/capoten.jpg",
        price: 3200,
    },
    {
        name: "dapaveldactin",
        description: "دابافيلداكتين هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يساعد في تقليل نسبة السكر في الدم من خلال تعزيز التخلص من الجلوكوز عبر الكلى. يُستخدم عادةً مع الحمية الغذائية والتمارين الرياضية أو مع أدوية أخرى لضبط السكر في الدم. يعمل على تحسين التحكم في مستويات السكر وتقليل خطر المضاعفات المرتبطة بالسكري، مثل أمراض القلب والكلى. يُفضل استخدامه تحت إشراف طبي لضبط الجرعة وضمان فعاليته بشكل آمن.",
        specifications: "1. يعمل على تقليل مستويات السكر في الدم من خلال منع إعادة امتصاص الجلوكوز في الكلى.\n2. يُساعد في تحسين حساسية الأنسولين وتعزيز استخدام الجلوكوز في الجسم.\n3. يساهم في فقدان الوزن لدى بعض المرضى كأثر جانبي إيجابي.\n4. يُقلل من مخاطر الإصابة بأمراض القلب لدى مرضى السكري.\n5. يُستخدم كعلاج مساعد إلى جانب الحمية والرياضة.\n6. يُقلل من خطر الإصابة بمضاعفات الكلى المرتبطة بالسكري.",
        dest: "1. يحتوي على مادة داباجليفلوزين، التي تمنع إعادة امتصاص الجلوكوز في الكلى.\n2. يعمل على زيادة إفراز الجلوكوز مع البول مما يُخفض مستوياته في الدم.\n3. يُمتص بسرعة في الجسم ويبدأ مفعوله في غضون ساعات قليلة.\n4. يُقلل من مقاومة الأنسولين مما يساعد في تحسين التحكم بالسكري.\n5. يُستخدم بشكل منفرد أو مع أدوية أخرى لعلاج مرض السكري من النوع الثاني.\n6. يُساعد في تحسين صحة القلب والأوعية الدموية.",
        image: "../image3/dapaveldactin.jpg",
        price: 3200,
    },
    {
        name: "diaoptim-MR",
        description: "دياوبتيم-MR هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني عن طريق تحسين استجابة الجسم للأنسولين وتقليل إنتاج الجلوكوز في الكبد. يعمل على تقليل مستويات السكر في الدم ويساعد في التحكم بها على المدى الطويل. يُستخدم عادةً مع نظام غذائي صحي وممارسة الرياضة، ويمكن تناوله بمفرده أو مع أدوية أخرى. يُفضل تناوله وفق إرشادات الطبيب لتجنب أي آثار جانبية محتملة.",
        specifications: "1. يُساعد في تقليل مستويات السكر في الدم وتحسين التحكم بها.\n2. يقلل من إنتاج الجلوكوز في الكبد مما يُساعد في تقليل ارتفاع السكر بعد الوجبات.\n3. يُستخدم كعلاج وحيد أو مع أدوية أخرى لعلاج السكري.\n4. يُحسن استجابة الجسم للأنسولين ويُقلل من مقاومته.\n5. يُقلل من خطر الإصابة بمضاعفات السكري مثل أمراض القلب.\n6. يتميز بإطلاقه المستمر مما يساعد في تنظيم مستويات السكر على مدار اليوم.",
        dest: "1. يحتوي على مادة ميتفورمين، التي تعمل على تقليل إنتاج الجلوكوز في الكبد.\n2. يُحسن امتصاص الأنسولين في الخلايا مما يساعد في خفض مستويات السكر.\n3. يعمل بآلية إطلاق مستمر لضمان تحكم مستقر في مستوى الجلوكوز.\n4. يُمتص جيدًا في الجهاز الهضمي ويبدأ مفعوله خلال ساعات من تناوله.\n5. يُستخدم لعلاج السكري من النوع الثاني ويُساعد في تقليل الوزن لدى بعض المرضى.\n6. يُقلل من خطر الإصابة بأمراض القلب المرتبطة بالسكري.",
        image: "../image3/diaoptim-MR.jpg",
        price: 3200,
    },
    {
        name: "divinus",
        description: "ديفينوس هو دواء يُستخدم لعلاج ارتفاع ضغط الدم والوقاية من المضاعفات القلبية. يعمل على استرخاء الأوعية الدموية مما يُساعد في تقليل ضغط الدم وتحسين تدفق الدم في الجسم. يُستخدم لعلاج ارتفاع ضغط الدم المزمن وللوقاية من السكتات الدماغية والنوبات القلبية. يُفضل تناوله وفقًا لإرشادات الطبيب لضمان تحقيق أفضل النتائج دون آثار جانبية خطيرة.",
        specifications: "1. يُستخدم في علاج ارتفاع ضغط الدم وتقليل مخاطر الإصابة بالنوبات القلبية.\n2. يُساعد في توسيع الأوعية الدموية مما يُحسن تدفق الدم.\n3. يُستخدم لعلاج بعض أمراض القلب والشرايين.\n4. يُساعد في تقليل الضغط على القلب وتحسين كفاءته.\n5. يُقلل من خطر الإصابة بالسكتات الدماغية.\n6. يُستخدم بجرعات يحددها الطبيب بناءً على حالة المريض.",
        dest: "1. يحتوي على مواد فعالة تعمل على استرخاء الأوعية الدموية وتقليل الضغط.\n2. يُساعد في تحسين تدفق الدم إلى القلب مما يُقلل من إجهاده.\n3. يُقلل من مخاطر الإصابة بمضاعفات القلب الناجمة عن ارتفاع ضغط الدم.\n4. يُمتص في الجسم بسرعة ويبدأ تأثيره خلال ساعات قليلة.\n5. يُستخدم كعلاج طويل الأمد للتحكم في ضغط الدم.\n6. يُفضل تناوله تحت إشراف طبي لضبط الجرعة المناسبة.",
        image: "../image3/divinus.jpg",
        price: 3200,
    },
    {
        name: "exforge",
        description: "إكسفورج هو دواء يُستخدم لعلاج ارتفاع ضغط الدم، حيث يحتوي على مزيج من مادتين فعالتين تساعدان في خفض ضغط الدم بشكل فعال. يعمل على توسيع الأوعية الدموية وتقليل الضغط عليها مما يُساعد في تحسين تدفق الدم. يُستخدم في الحالات التي لا تستجيب للعلاج بأدوية الضغط الأخرى، ويُنصح بتناوله تحت إشراف طبي.",
        specifications: "1. يُستخدم في علاج ارتفاع ضغط الدم المقاوم للأدوية الأخرى.\n2. يحتوي على مادتين فعالتين تساعدان في توسيع الأوعية الدموية.\n3. يُقلل من خطر الإصابة بالسكتات الدماغية والنوبات القلبية.\n4. يُساهم في تحسين كفاءة القلب وتقليل الضغط عليه.\n5. يُساعد في تحسين تدفق الدم في الجسم.\n6. يُستخدم في الحالات المزمنة التي تحتاج إلى ضبط فعال للضغط.",
        dest: "1. يحتوي على مزيج من فالسارتان وأملوديبين لتوسيع الأوعية الدموية.\n2. يعمل على خفض ضغط الدم بآلية مزدوجة لتأثير أقوى.\n3. يُمتص في الجهاز الهضمي ويبدأ تأثيره خلال ساعات.\n4. يُستخدم لعلاج الحالات المستعصية من ارتفاع الضغط.\n5. يُقلل من خطر المضاعفات القلبية المرتبطة بارتفاع الضغط.\n6. يُفضل تناوله تحت إشراف طبي لضبط الجرعة المناسبة.",
        image: "../image3/exforge.jpg",
        price: 3200,
    },

    {
        name: "fast-flam",
        description: "فاست-فلام هو دواء مضاد للالتهابات غير الستيرويدية يُستخدم لتخفيف الألم وتقليل الالتهابات. يُستخدم في حالات التهاب المفاصل، آلام العضلات، وآلام الأسنان، كما أنه فعال في تخفيف الألم بعد العمليات الجراحية. يعمل على تثبيط إنزيمات الأكسدة الحلقية التي تسبب الالتهاب والألم، مما يجعله خيارًا فعالًا لتخفيف الأعراض المرتبطة بالتهابات المفاصل والأوتار. يُستخدم تحت إشراف طبي لتجنب أي آثار جانبية محتملة خاصةً للمصابين بأمراض المعدة أو القلب.",
        specifications: `1. يحتوي على مادة ديكلوفيناك بوتاسيوم كمضاد للالتهابات.
2. يعمل على تثبيط إنزيمات الأكسدة الحلقية لتقليل الالتهاب.
3. يُستخدم لعلاج التهاب المفاصل وآلام العضلات والعظام.
4. يُساعد في تخفيف الألم بعد العمليات الجراحية.
5. يُقلل التورم ويُحسن من حركة المفاصل.
6. يُستخدم تحت إشراف طبي لضمان الاستخدام الآمن.`,
        dest: `1. يحتوي على مادة فعالة تُساعد في تقليل الالتهاب والألم.
2. يُستخدم لعلاج الحالات الحادة والمزمنة من التهاب المفاصل.
3. يُساعد في تخفيف الألم الناتج عن الإصابات الرياضية.
4. يُحسن من قدرة المريض على الحركة عند وجود آلام التهابية.
5. يُقلل من التورم والاحمرار المرتبط بالتهابات المفاصل.
6. يُفضل تناوله بعد الطعام لتقليل احتمالية حدوث اضطرابات معدية.`,
        image: "../image3/fast-flam.jpg",
        price: 3200,
    },
    {
        name: "forxiga",
        description: "فوركسيجا هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يساعد في تقليل نسبة السكر في الدم عن طريق منع إعادة امتصاص الجلوكوز في الكلى وزيادة إخراجه مع البول. يُستخدم عادةً مع الحمية الغذائية والتمارين الرياضية لضبط مستويات السكر. كما يُساهم في تقليل مخاطر الإصابة بأمراض القلب والكلى لدى مرضى السكري. يُستخدم تحت إشراف الطبيب لتحديد الجرعة المناسبة لكل مريض حسب حالته الصحية.",
        specifications: `1. يحتوي على مادة داباجليفلوزين التي تعمل على منع امتصاص الجلوكوز في الكلى.
2. يُساعد في تقليل نسبة السكر في الدم عن طريق التخلص منه عبر البول.
3. يُستخدم لعلاج مرض السكري من النوع الثاني.
4. يُساعد في فقدان الوزن عند بعض المرضى.
5. يُقلل من خطر الإصابة بأمراض القلب والكلى المرتبطة بالسكري.
6. يُستخدم تحت إشراف طبي لضمان فعاليته وأمانه.`,
        dest: `1. يُساعد في ضبط مستويات السكر بآلية طبيعية دون زيادة إفراز الأنسولين.
2. يُقلل من مقاومة الأنسولين مما يُحسن من استخدام الجلوكوز في الجسم.
3. يُستخدم كعلاج منفرد أو مع أدوية أخرى لعلاج السكري.
4. يُمتص بسرعة ويبدأ مفعوله خلال ساعات قليلة.
5. يُقلل من مضاعفات مرض السكري طويلة المدى.
6. يُفضل استخدامه مع نظام غذائي صحي وممارسة الرياضة.`,
        image: "../image3/forxiga.jpg",
        price: 3200,
    },
    {
        name: "galvus-met",
        description: "جالفوس-ميت هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يحتوي على مزيج من مادتي فيلدجليبتين وميتفورمين، مما يُساعد في تحسين استجابة الجسم للأنسولين وتقليل إنتاج الجلوكوز في الكبد. يُساعد في ضبط مستويات السكر في الدم ويُقلل من خطر حدوث مضاعفات السكري مثل أمراض القلب والكلى. يُفضل تناوله تحت إشراف طبي لضبط الجرعة وفقًا لاحتياجات المريض.",
        specifications: `1. يحتوي على مزيج من فيلدجليبتين وميتفورمين لعلاج السكري.
2. يُساعد في تقليل إنتاج الجلوكوز في الكبد.
3. يُحسن استجابة الخلايا للأنسولين مما يقلل مستويات السكر.
4. يُستخدم في الحالات التي لا تستجيب للميتفورمين وحده.
5. يُقلل من خطر الإصابة بالمضاعفات المزمنة للسكري.
6. يُستخدم مع الحمية الغذائية وممارسة الرياضة لتحقيق أفضل النتائج.`,
        dest: `1. يُستخدم لعلاج مرضى السكري من النوع الثاني.
2. يُقلل من إنتاج السكر في الكبد ويُساعد في تحسين حساسية الأنسولين.
3. يُمتص جيدًا ويبدأ تأثيره خلال ساعات من تناوله.
4. يُقلل من نسبة السكر في الدم بطريقة فعالة وطويلة المدى.
5. يُفضل تناوله مع وجبات الطعام لتجنب اضطرابات المعدة.
6. يُستخدم تحت إشراف الطبيب لتحديد الجرعة المناسبة حسب حالة المريض.`,
        image: "../image3/galvus-met.jpg",
        price: 3200,
    },
    {
        name: "glimergl",
        description: "جليميرجل هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يعمل على تحفيز البنكرياس لإفراز الأنسولين وتقليل نسبة الجلوكوز في الدم. يُستخدم بشكل شائع للمرضى الذين لا يكفيهم النظام الغذائي وممارسة الرياضة وحدهما. يُفضل تناوله تحت إشراف طبي لضبط الجرعة المناسبة وتجنب أي آثار جانبية محتملة، مثل انخفاض السكر في الدم.",
        specifications: `1. يحتوي على مادة جليمبيريد التي تحفز إنتاج الأنسولين من البنكرياس.
2. يُساعد في تقليل مستويات السكر في الدم.
3. يُستخدم لعلاج مرض السكري من النوع الثاني.
4. يُحسن من استجابة الجسم للأنسولين.
5. يُقلل من خطر الإصابة بمضاعفات السكري على المدى الطويل.
6. يُستخدم تحت إشراف طبي لضبط الجرعة وتجنب انخفاض السكر الحاد.`,
        dest: `1. يُستخدم لعلاج مرض السكري من النوع الثاني.
2. يعمل على تحفيز إفراز الأنسولين مما يُخفض مستوى السكر في الدم.
3. يُستخدم كعلاج وحيد أو مع أدوية أخرى لضبط السكر.
4. يُساعد في تحسين استجابة الخلايا للأنسولين.
5. يُقلل من احتمالية حدوث مضاعفات السكري مثل تلف الأعصاب.
6. يُفضل تناوله مع وجبة الإفطار لضمان فعاليته وتجنب انخفاض السكر المفاجئ.`,
        image: "../image3/glimergl.jpg",
        price: 3200,
    },

    { 
        name: "glipizide", 
        description: `جليبيزيد هو دواء يستخدم لعلاج مرض السكري من النوع الثاني، حيث يساعد في تحفيز البنكرياس على إفراز الأنسولين لتقليل مستوى السكر في الدم. ينتمي هذا الدواء إلى فئة السلفونيل يوريا، والتي تعمل على تحسين استجابة الجسم للأنسولين. يتم وصفه عادةً للأشخاص الذين لا يستطيعون التحكم في مستوى السكر في الدم من خلال الحمية الغذائية فقط. من الضروري مراقبة مستويات السكر بانتظام أثناء استخدامه لتجنب حدوث انخفاض حاد في السكر. ينصح باستخدامه مع نظام غذائي صحي وممارسة الرياضة بانتظام لتحقيق أفضل النتائج.` , 
        specifications: `
        1. يستخدم لعلاج مرض السكري من النوع الثاني عن طريق تحفيز إفراز الأنسولين من البنكرياس، مما يساعد في تقليل مستوى السكر في الدم.  
        2. يعمل على تحسين استجابة الجسم للأنسولين ويزيد من كفاءة استخدام الجلوكوز في الخلايا.  
        3. يساعد في تقليل احتمالية حدوث مضاعفات السكري مثل أمراض القلب والأوعية الدموية عند الاستخدام المنتظم.  
        4. يفضل استخدامه مع نظام غذائي صحي وممارسة الرياضة للحصول على نتائج أفضل في التحكم بمستوى السكر في الدم.  
        5. يجب تناوله تحت إشراف طبيب مختص لتحديد الجرعة المناسبة وتجنب أي مضاعفات غير مرغوب فيها.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **جليبيزيد**، وهي من فئة السلفونيل يوريا التي تحفز البنكرياس لإفراز المزيد من الأنسولين.  
        2. يعمل على خفض مستوى السكر في الدم من خلال زيادة حساسية مستقبلات الأنسولين في الخلايا.  
        3. يتم تناوله عن طريق الفم على شكل أقراص، ويُنصح بتناوله قبل الوجبة الرئيسية للمساعدة في التحكم بمستوى السكر بعد الأكل.  
        `,  
        image: "../image3/glipizide.jpg", 
        price: 3200,
    },
    { 
        name: "glocovag-xr", 
        description: `جلوكوفاج XR هو دواء يستخدم لعلاج مرض السكري من النوع الثاني، حيث يعمل على تحسين استجابة الجسم للأنسولين وتقليل مستوى الجلوكوز في الدم. يتميز هذا الدواء بآلية إطلاق ممتدة، مما يجعله أكثر استقرارًا في الحفاظ على مستويات السكر لفترة أطول. يساهم في تقليل مقاومة الأنسولين ويقلل من إنتاج الكبد للجلوكوز، مما يساعد على تنظيم مستوى السكر في الدم بشكل فعال. يوصى باستخدامه كجزء من خطة علاج شاملة تشمل الحمية الغذائية والتمارين الرياضية.` , 
        specifications: `
        1. يعالج مرض السكري من النوع الثاني عن طريق تحسين استجابة الجسم للأنسولين وتقليل مستوى الجلوكوز في الدم.  
        2. يقلل من إنتاج الجلوكوز في الكبد ويحد من امتصاص السكر في الأمعاء، مما يساعد في تحقيق استقرار أفضل لمستويات السكر.  
        3. يتميز بآلية إطلاق ممتدة، مما يسمح بفعالية أطول ويقلل من احتمالية حدوث تقلبات في مستوى السكر.  
        4. يساعد في تقليل مقاومة الأنسولين، مما يجعله خيارًا مناسبًا للأشخاص الذين يعانون من ارتفاع السكر المستمر.  
        5. يقلل من احتمالية حدوث مضاعفات السكري على المدى الطويل مثل مشاكل القلب والأوعية الدموية.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **ميتفورمين هيدروكلوريد**، وهي من فئة البيغوانيد التي تقلل من إنتاج الجلوكوز في الكبد.  
        2. يعمل على تحسين حساسية الأنسولين في الخلايا، مما يساعد في استخدام الجلوكوز بكفاءة أكبر.  
        3. يتميز بتركيب يجعله ذو تأثير طويل المدى، مما يقلل من الحاجة إلى تناول الجرعات المتكررة خلال اليوم.  
        `,  
        image: "../image3/glocovag-xr.jpg", 
        price: 3200,
    },
    { 
        name: "glucophage", 
        description: `جلوكوفاج هو أحد الأدوية الأكثر استخدامًا في علاج مرض السكري من النوع الثاني، حيث يساعد في تقليل إنتاج الكبد للجلوكوز وتحسين استجابة الجسم للأنسولين. لا يؤدي إلى زيادة في إفراز الأنسولين، مما يجعله خيارًا مناسبًا للمرضى الذين يعانون من مقاومة الأنسولين. يستخدم أيضًا في بعض الحالات الأخرى مثل متلازمة تكيس المبايض والمساعدة في إنقاص الوزن لدى بعض المرضى.` , 
        specifications: `
        1. يعالج مرض السكري من النوع الثاني من خلال تحسين حساسية الجسم للأنسولين وتقليل إنتاج الكبد للجلوكوز.  
        2. يقلل من امتصاص السكر في الأمعاء، مما يساعد في الحفاظ على مستوى الجلوكوز ضمن المعدل الطبيعي.  
        3. يساهم في إنقاص الوزن لدى بعض المرضى الذين يعانون من السمنة، مما يجعله خيارًا علاجيًا متعدد الفوائد.  
        4. يمكن استخدامه لعلاج متلازمة تكيس المبايض لدى النساء، حيث يساعد في تحسين استجابة الجسم للأنسولين.  
        5. يقلل من خطر الإصابة بالمضاعفات المرتبطة بمرض السكري مثل أمراض القلب والسكتة الدماغية.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **ميتفورمين هيدروكلوريد**، والتي تنتمي إلى فئة البيغوانيد.  
        2. يعمل على تقليل إنتاج الجلوكوز في الكبد وتحسين استجابة الجسم للأنسولين دون التسبب في انخفاض حاد لمستويات السكر.  
        3. يستخدم كعلاج أولي لمعظم مرضى السكري من النوع الثاني، نظرًا لفعاليته العالية وأمانه النسبي مقارنةً ببعض الأدوية الأخرى.  
        `,  
        image: "../image3/glucophage.jpg", 
        price: 3200,
    },
    { 
        name: "janumet", 
        description: `جانوميت هو دواء مركب يجمع بين ميتفورمين وسيتاجليبتين لعلاج مرض السكري من النوع الثاني. يعمل هذا الدواء من خلال آليتين مختلفتين؛ حيث يقلل ميتفورمين من إنتاج الجلوكوز في الكبد ويحسن حساسية الأنسولين، بينما يساعد سيتاجليبتين في تنظيم مستويات السكر عن طريق زيادة مستويات هرمونات الإنكرتين التي تحفز إفراز الأنسولين.` , 
        specifications: `
        1. يساعد في خفض مستوى السكر في الدم لدى مرضى السكري من النوع الثاني من خلال تأثير مزدوج للمواد الفعالة.  
        2. يحسن استجابة الجسم للأنسولين ويقلل من إنتاج الجلوكوز في الكبد، مما يساعد في تحقيق استقرار أكبر لمستويات السكر.  
        3. يمنع تحلل هرمونات الإنكرتين، مما يزيد من إفراز الأنسولين عند الحاجة ويقلل من إفرازه عند انخفاض السكر.  
        4. مناسب للأشخاص الذين لا يحققون تحكمًا جيدًا في مستوى السكر باستخدام الميتفورمين وحده.  
        5. يقلل من خطر حدوث انخفاض حاد في السكر مقارنة ببعض الأدوية الأخرى المستخدمة في علاج السكري.  
        `, 
        dest: `
        1. يحتوي على **ميتفورمين** وسيتاجليبتين، وهما مادتان تعملان معًا لتحقيق تحكم فعال في مستوى السكر في الدم.  
        2. ينتمي إلى فئتي **مثبطات DPP-4** و**البيغوانيد**، مما يجعله دواءً متعدد الفعالية في تنظيم نسبة الجلوكوز.  
        3. يتم تناوله عن طريق الفم على شكل أقراص، ويفضل تناوله مع الطعام لتجنب اضطرابات الجهاز الهضمي.  
        `,  
        image: "../image3/janumet.jpg", 
        price: 3200,
    },
    
    { 
        name: "januvia", 
        description: `جانوفيا هو دواء يستخدم لعلاج مرض السكري من النوع الثاني، حيث يساعد في التحكم في مستويات السكر في الدم دون التسبب في انخفاض حاد. يعمل هذا الدواء عن طريق تثبيط إنزيم DPP-4، مما يؤدي إلى زيادة مستويات الإنكرتين، وهي هرمونات تساعد في تحفيز إفراز الأنسولين وتقليل إنتاج الجلوكوز في الكبد. يمكن استخدام جانوفيا بمفرده أو مع أدوية أخرى مثل الميتفورمين للحصول على تحكم أفضل في مستويات السكر. يتميز هذا الدواء بأنه لا يسبب زيادة في الوزن مثل بعض أدوية السكري الأخرى، كما أنه يقلل من خطر حدوث نوبات انخفاض السكر الحاد.`, 
        specifications: `
        1. يساعد في تنظيم مستوى السكر في الدم من خلال تحفيز إفراز الأنسولين وتقليل إنتاج الجلوكوز.  
        2. يستخدم بمفرده أو مع أدوية أخرى مثل الميتفورمين لتحقيق تحكم أفضل في مستويات السكر.  
        3. يقلل من خطر حدوث نوبات انخفاض السكر مقارنةً بأدوية السكري التقليدية.  
        4. لا يسبب زيادة في الوزن، مما يجعله مناسبًا للمرضى الذين يعانون من السمنة.  
        5. يستخدم لعلاج مرض السكري من النوع الثاني فقط، ولا يُنصح باستخدامه في حالات السكري من النوع الأول.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **سيتاجليبتين**، وهي من مثبطات إنزيم DPP-4.  
        2. يعزز من تأثير هرمونات الإنكرتين المسؤولة عن تنظيم إفراز الأنسولين.  
        3. يقلل من إنتاج الجلوكوز في الكبد مما يساعد في خفض مستويات السكر في الدم.  
        4. يُتناول عن طريق الفم مرة واحدة يوميًا مع أو بدون الطعام.  
        `,  
        image: "../image3/januvia.jpg", 
        price: 3200,
    },
    { 
        name: "jardiance", 
        description: `جارديانس هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني ويعمل بطريقة مختلفة عن الأدوية الأخرى، حيث يساعد في خفض مستويات السكر في الدم عن طريق منع إعادة امتصاص الجلوكوز في الكلى، مما يؤدي إلى التخلص منه مع البول. ينتمي هذا الدواء إلى فئة مثبطات SGLT2 التي أثبتت فعاليتها في تحسين صحة القلب والأوعية الدموية لدى مرضى السكري، كما أنه يساعد في تقليل خطر الإصابة بفشل القلب. يتميز جارديانس بقدرته على تقليل ضغط الدم وتحسين حساسية الأنسولين، مما يجعله مفيدًا للأشخاص الذين يعانون من ارتفاع ضغط الدم أو السمنة مع مرض السكري.`, 
        specifications: `
        1. يخفض مستويات السكر في الدم عن طريق زيادة إفراز الجلوكوز في البول.  
        2. يساعد في تقليل ضغط الدم وتحسين وظائف القلب والأوعية الدموية.  
        3. يقلل من خطر الإصابة بفشل القلب لدى مرضى السكري.  
        4. قد يساعد في فقدان الوزن، مما يجعله مفيدًا لمرضى السكري الذين يعانون من السمنة.  
        5. يعمل بشكل مستقل عن الأنسولين، مما يجعله خيارًا جيدًا للمرضى الذين لا يستجيبون للعلاجات التقليدية.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **إمباجليفلوزين**، وهي من مثبطات SGLT2.  
        2. يمنع إعادة امتصاص الجلوكوز في الكلى مما يساعد في خفض مستوى السكر في الدم.  
        3. يستخدم مرة واحدة يوميًا في الصباح مع أو بدون الطعام.  
        4. يساهم في تقليل مخاطر الإصابة بمشاكل القلب لدى مرضى السكري.  
        `,  
        image: "../image3/jardiance.jpg", 
        price: 3200,
    },
    { 
        name: "levodopa", 
        description: `ليفودوبا هو دواء يُستخدم لعلاج مرض باركنسون (الشلل الرعاش)، حيث يعمل على تعويض نقص الدوبامين في الدماغ، وهو الناقل العصبي المسؤول عن التحكم في الحركة. يُعد ليفودوبا العلاج الأكثر فعالية لتخفيف أعراض باركنسون مثل الرعشة، التصلب، وبطء الحركة. يتم امتصاصه في الجسم وتحويله إلى دوبامين، مما يساعد المرضى على استعادة القدرة على الحركة الطبيعية. يُستخدم غالبًا مع دواء كاربيدوبا لمنع تكسيره قبل وصوله إلى الدماغ، مما يزيد من فعاليته ويقلل من آثاره الجانبية. يعتبر هذا الدواء جزءًا أساسيًا في علاج مرض باركنسون ويُوصى به تحت إشراف طبي دقيق.`, 
        specifications: `
        1. يُستخدم لعلاج مرض باركنسون عن طريق تعويض نقص الدوبامين في الدماغ.  
        2. يساعد في تحسين الحركة وتقليل أعراض مثل التصلب والرعشة وبطء الحركة.  
        3. يُعطى غالبًا مع كاربيدوبا لمنع تكسيره قبل وصوله إلى الدماغ.  
        4. قد يحتاج المريض إلى تعديل الجرعة بمرور الوقت لضمان الفعالية المثلى.  
        5. يجب تناوله تحت إشراف طبي، حيث يمكن أن يسبب آثارًا جانبية مثل الغثيان والدوخة.  
        `, 
        dest: `
        1. يحتوي على المادة الفعالة **ليفودوبا**، التي تتحول إلى دوبامين في الدماغ.  
        2. غالبًا ما يُستخدم مع **كاربيدوبا** لتحسين امتصاصه وتقليل آثاره الجانبية.  
        3. متوفر على شكل أقراص تؤخذ عن طريق الفم، ويفضل تناوله مع الطعام.  
        `,  
        image: "../image3/levodopa.jpg", 
        price: 3200,
    },
    { 
        name: "milga", 
        description: `ميلجا هو مكمل غذائي مخصص لدعم صحة الأعصاب، حيث يحتوي على مزيج من الفيتامينات المهمة مثل فيتامين B1، B6، وB12، والتي تلعب دورًا حيويًا في تحسين وظائف الجهاز العصبي وتقليل الالتهابات العصبية. يستخدم هذا المكمل بشكل شائع لعلاج حالات التهاب الأعصاب الطرفية الناتجة عن مرض السكري أو نقص الفيتامينات، كما يساهم في تحسين التركيز وتقوية الذاكرة. يساعد ميلجا أيضًا في علاج آلام الظهر والتهابات الأعصاب الناجمة عن الضغط على الفقرات. بفضل تركيبته الغنية بالفيتامينات، فإنه يُعتبر خيارًا مثاليًا لدعم صحة الأعصاب وتحسين الأداء العصبي العام.`, 
        specifications: `
        1. يدعم صحة الأعصاب ويقلل من الالتهابات العصبية المرتبطة بالسكري أو نقص الفيتامينات.  
        2. يساعد في تحسين التركيز وتقوية الذاكرة بفضل فيتامين B12.  
        3. يستخدم لعلاج آلام الظهر والتهابات الأعصاب الناتجة عن الضغط على الفقرات.  
        4. يقلل من الإجهاد العصبي والتعب المزمن المرتبط بنقص فيتامين B.  
        5. يعزز وظائف الجهاز العصبي ويحسن نقل الإشارات العصبية في الجسم.  
        `, 
        dest: `
        1. يحتوي على **فيتامين B1 (الثيامين)**، الذي يساعد في تحسين وظائف الأعصاب.  
        2. يحتوي على **فيتامين B6 (البيريدوكسين)**، الذي يساهم في تقليل التهابات الأعصاب.  
        3. يحتوي على **فيتامين B12 (السيانوكوبالامين)**، الضروري لصحة الأعصاب وتكوين خلايا الدم الحمراء.  
        4. يتوفر على شكل أقراص تؤخذ بعد الوجبات لتحقيق أفضل امتصاص.  
        `,  
        image: "../image3/milga.jpg", 
        price: 3200,
    },
    { 
        name: "muscadol", 
        description: `مسكادول هو دواء مسكن للألم وباسط للعضلات، يُستخدم لتخفيف التشنجات العضلية والآلام الناتجة عن الإجهاد أو الإصابات. يحتوي هذا الدواء على تركيبة فعالة تعمل على استرخاء العضلات وتقليل التقلصات، مما يجعله مفيدًا لعلاج آلام أسفل الظهر، والتهابات المفاصل، والصداع التوتري. يُستخدم أيضًا في حالات الإجهاد العضلي بعد ممارسة الرياضة أو العمل البدني الشاق، حيث يساعد في استعادة مرونة العضلات بسرعة.`, 
        specifications: `
        1. يخفف التشنجات العضلية ويعمل على استرخاء العضلات.  
        2. يُستخدم لعلاج آلام أسفل الظهر والتهابات المفاصل.  
        3. يساعد في تخفيف الصداع التوتري والآلام الناتجة عن الإجهاد العضلي.  
        4. يُفضل تناوله بعد الطعام لتقليل آثاره الجانبية على المعدة.  
        5. مناسب للرياضيين والأشخاص الذين يعانون من التشنجات العضلية المتكررة.  
        `, 
        dest: `
        1. يحتوي على **باراسيتامول** كمسكن للألم وخافض للحرارة.  
        2. يحتوي على **مادة ميثوكاربامول** التي تعمل على ارتخاء العضلات.  
        3. يؤخذ بجرعة يحددها الطبيب حسب شدة الحالة.  
        4. لا يُنصح باستخدامه لفترات طويلة دون استشارة طبية.  
        `,  
        image: "../image3/muscadol.jpg", 
        price: 3200,
    },
    { 
        name: "nevilob", 
        description: `نيفيلوب هو دواء يُستخدم لعلاج ارتفاع ضغط الدم وأمراض القلب، حيث ينتمي إلى فئة حاصرات بيتا التي تساعد في تقليل ضغط الدم ومعدل ضربات القلب، مما يقلل من خطر الإصابة بالنوبات القلبية والسكتات الدماغية. يُوصى به للمرضى الذين يعانون من ارتفاع ضغط الدم المزمن أو قصور القلب الاحتقاني، كما يُستخدم لتحسين الأداء القلبي وتقليل الأعراض مثل ضيق التنفس والإرهاق.`, 
        specifications: `
        1. يُستخدم لعلاج ارتفاع ضغط الدم وتقليل خطر الإصابة بالنوبات القلبية.  
        2. يساعد في تحسين وظائف القلب لدى مرضى قصور القلب.  
        3. يعمل على تقليل معدل ضربات القلب وتحسين كفاءة الدورة الدموية.  
        4. يُفضل تناوله في نفس الوقت يوميًا لتحقيق أفضل النتائج.  
        5. يجب استشارة الطبيب قبل استخدامه خاصةً في حالات الربو أو أمراض الجهاز التنفسي.  
        `, 
        dest: `
        1. يحتوي على **نيبيفولول**، وهو من حاصرات بيتا التي تساعد في خفض ضغط الدم.  
        2. يعمل على توسيع الأوعية الدموية وتحسين تدفق الدم.  
        3. يؤخذ مرة واحدة يوميًا بجرعة يحددها الطبيب.  
        4. لا يُنصح بإيقافه فجأة دون استشارة طبية.  
        `,  
        image: "../image3/nevilob.jpg", 
        price: 3200,
    },
    { 
        name: "replss", 
        description: `ريبليس هو دواء يُستخدم لعلاج ارتفاع ضغط الدم وحماية القلب والأوعية الدموية من المضاعفات الخطيرة. يعمل على توسيع الأوعية الدموية، مما يساعد في تحسين تدفق الدم وتقليل الضغط على القلب. يُوصى به للمرضى الذين يعانون من ارتفاع ضغط الدم المزمن أو المعرضين لخطر الإصابة بأمراض القلب.`, 
        specifications: `
        1. يساعد في خفض ضغط الدم المرتفع وتحسين تدفق الدم.  
        2. يقلل من خطر الإصابة بأمراض القلب والسكتة الدماغية.  
        3. يُستخدم بمفرده أو مع أدوية أخرى لعلاج ارتفاع ضغط الدم.  
        4. يُفضل تناوله في الصباح لضمان فعاليته طوال اليوم.  
        5. لا يُنصح باستخدامه دون استشارة الطبيب، خاصةً لمن يعانون من مشاكل في الكلى أو الكبد.  
        `, 
        dest: `
        1. يحتوي على **فالسارتان**، وهو من مضادات مستقبلات الأنجيوتنسين 2 التي تعمل على توسيع الأوعية الدموية.  
        2. يُساعد في تقليل الإجهاد على القلب وتحسين وظائفه.  
        3. متوفر على شكل أقراص تؤخذ مرة يوميًا مع أو بدون الطعام.  
        4. يجب الالتزام بالجرعة المحددة من قبل الطبيب.  
        `,  
        image: "../image3/replss.jpg", 
        price: 3200,
    },
    { 
        name: "sevikar", 
        description: `سيفيكار هو دواء مخصص لعلاج ارتفاع ضغط الدم، حيث يجمع بين مادتين فعالتين تعملان معًا لتوسيع الأوعية الدموية وتحسين تدفق الدم، مما يساعد في تقليل الضغط على القلب. يُستخدم هذا الدواء للمرضى الذين يعانون من ارتفاع ضغط الدم المزمن والذين لا يستجيبون بشكل كافٍ لعلاج واحد فقط.`, 
        specifications: `
        1. يخفض ضغط الدم بفعالية من خلال توسيع الأوعية الدموية.  
        2. يحتوي على مزيج من مادتين فعاليتين لزيادة الفعالية العلاجية.  
        3. يقلل من خطر الإصابة بالنوبات القلبية والسكتات الدماغية.  
        4. يُستخدم مرة واحدة يوميًا مع أو بدون الطعام.  
        5. لا يُنصح بإيقافه فجأة دون استشارة الطبيب.  
        `, 
        dest: `
        1. يحتوي على **أملوديبين**، الذي يعمل على توسيع الأوعية الدموية وتحسين تدفق الدم.  
        2. يحتوي على **أولميسارتان**، الذي يمنع تأثير الأنجيوتنسين 2 المسؤول عن تضييق الأوعية الدموية.  
        3. متوفر على شكل أقراص تؤخذ عن طريق الفم.  
        4. يجب تناوله بانتظام للحصول على أفضل نتائج.  
        `,  
        image: "../image3/sevikar.jpg", 
        price: 3200,
    },
    { 
        name: "tabuvan", 
        description: `تابوفان هو دواء يستخدم لعلاج ارتفاع ضغط الدم وحماية القلب من المضاعفات الناتجة عن الإجهاد المستمر. يعمل على منع تأثير هرمون الأنجيوتنسين 2 الذي يسبب تضييق الأوعية الدموية، مما يؤدي إلى خفض ضغط الدم وتحسين تدفق الدم. يُوصى به للمرضى الذين يعانون من ارتفاع ضغط الدم أو قصور القلب الاحتقاني.`, 
        specifications: `
        1. يُستخدم لخفض ضغط الدم المرتفع ومنع المضاعفات القلبية.  
        2. يساعد في تحسين تدفق الدم وتقليل الضغط على القلب.  
        3. يمكن استخدامه بمفرده أو مع أدوية أخرى لضبط ضغط الدم.  
        4. يؤخذ مرة واحدة يوميًا مع الطعام أو بدونه.  
        5. لا يُنصح باستخدامه أثناء الحمل أو الرضاعة دون استشارة الطبيب.  
        `, 
        dest: `
        1. يحتوي على **فالسارتان**، الذي يمنع تأثير الأنجيوتنسين 2 المسؤول عن تضييق الأوعية الدموية.  
        2. يُحسن من وظائف القلب ويقلل من خطر المضاعفات القلبية.  
        3. يُستخدم في علاج حالات قصور القلب إلى جانب ضبط ضغط الدم.  
        4. يجب تناوله بانتظام للحصول على أفضل النتائج العلاجية.  
        `,  
        image: "../image3/tabuvan.jpg", 
        price: 3200,
    },
    { 
        name: "trajenta", 
        description: `تراجينتا هو دواء يُستخدم لعلاج مرض السكري من النوع الثاني، حيث يعمل على تحسين مستويات السكر في الدم من خلال تثبيط إنزيم DPP-4، مما يساعد في تعزيز تأثير هرمونات الإنكريتين التي تحفز إفراز الإنسولين وتقليل إنتاج الجلوكوز في الكبد. يُعد مناسبًا للمرضى الذين لا يستطيعون التحكم في نسبة السكر بالحمية الغذائية والتمارين وحدهما. يتميز بسهولة استخدامه، حيث يُؤخذ مرة واحدة يوميًا مع أو بدون طعام. لا يُسبب نقصًا حادًا في السكر عند استخدامه بمفرده، لكنه قد يكون أكثر فعالية عند دمجه مع أدوية أخرى مثل الميتفورمين. يُفضل المتابعة مع الطبيب لمراقبة مستوى السكر والتأكد من فعالية العلاج.`,
        specifications: `
        1. يساعد في تحسين السيطرة على مستويات السكر في الدم لدى مرضى السكري من النوع الثاني.  
        2. يُستخدم كعلاج منفرد أو مع أدوية أخرى مثل الميتفورمين أو الأنسولين.  
        3. يُؤخذ مرة واحدة يوميًا بغض النظر عن الوجبات.  
        4. لا يُسبب انخفاضًا شديدًا في السكر عند استخدامه بمفرده.  
        5. يُفضل إجراء فحوصات دورية لمراقبة مستوى السكر أثناء الاستخدام.  
        `, 
        dest: `
        1. يحتوي على **ليناجليبتين**، وهو مثبط لإنزيم DPP-4.  
        2. يحسن من استجابة الجسم للإنسولين ويقلل من إنتاج الجلوكوز في الكبد.  
        3. متوفر على شكل أقراص تؤخذ مرة واحدة يوميًا.  
        4. غير مناسب لمرضى السكري من النوع الأول أو المصابين بحماض كيتوني سكري.  
        `,  
        image: "../image3/trajenta.jpg", 
        price: 3200,
    },
    { 
        name: "vascodIdIne", 
        description: `فاسكوديدين هو دواء يستخدم لعلاج ارتفاع ضغط الدم عن طريق توسيع الأوعية الدموية، مما يسمح بتدفق الدم بشكل أكثر سلاسة ويقلل من الضغط على القلب. يحتوي على مادة أملوديبين التي تعمل كمثبط لقنوات الكالسيوم، مما يمنع تضيق الأوعية الدموية ويخفض ضغط الدم. يُستخدم في الوقاية من السكتات الدماغية والنوبات القلبية، خاصة للمرضى الذين يعانون من ارتفاع ضغط الدم المزمن. يمكن تناوله مرة واحدة يوميًا، ويفضل الالتزام بنفس التوقيت لضمان فعالية الدواء. على الرغم من فوائده، يجب استشارة الطبيب قبل استخدامه لتحديد الجرعة المناسبة وتجنب أي مضاعفات صحية محتملة.`,
        specifications: `
        1. يُستخدم لعلاج ارتفاع ضغط الدم وتقليل خطر الإصابة بالأزمات القلبية.  
        2. يساعد في تحسين تدفق الدم إلى القلب وتقليل العبء عليه.  
        3. يعمل على توسيع الأوعية الدموية مما يساعد في خفض ضغط الدم.  
        4. يُفضل تناوله يوميًا في نفس الوقت للحصول على أفضل النتائج.  
        5. يجب استشارة الطبيب لتحديد الجرعة المناسبة حسب حالة المريض.  
        `, 
        dest: `
        1. يحتوي على **أملوديبين**، وهو مثبط لقنوات الكالسيوم يعمل على توسيع الأوعية الدموية.  
        2. يقلل من مقاومة الأوعية الدموية ويخفض ضغط الدم تدريجيًا.  
        3. يُؤخذ مرة واحدة يوميًا مع أو بدون طعام.  
        4. غير مناسب للأشخاص الذين يعانون من انخفاض حاد في ضغط الدم أو حساسية تجاه أملوديبين.  
        `,  
        image: "../image3/vascodIdIne.jpg", 
        price: 3200,
    },
    { 
        name: "xlgduo", 
        description: `إكس إل جي ديو هو دواء فعال في علاج مرض السكري من النوع الثاني، حيث يحتوي على مزيج من داباجليفلوزين وميتفورمين. يعمل هذا الدواء عن طريق تقليل إنتاج الجلوكوز في الكبد وزيادة إفراز الجلوكوز عن طريق البول، مما يساعد في تحسين مستوى السكر في الدم. يُستخدم في المرضى الذين لم يتمكنوا من تحقيق تحكم كافٍ في نسبة السكر بالحمية الغذائية والتمارين وحدهما. يجب تناوله مع الطعام لتقليل اضطرابات الجهاز الهضمي. يُنصح بإجراء فحوصات دورية لوظائف الكلى أثناء استخدام الدواء، حيث قد يؤدي إلى فقدان السوائل بشكل زائد.`,
        specifications: `
        1. يُساعد في تحسين التحكم في مستويات السكر لدى مرضى السكري من النوع الثاني.  
        2. يحتوي على مزيج من مادتين فعالتين تعزز من كفاءة الدواء.  
        3. يُفضل تناوله مع الطعام لتقليل اضطرابات الجهاز الهضمي.  
        4. يُساعد في تقليل امتصاص الجلوكوز من الأمعاء وإفرازه عبر الكلى.  
        5. يجب استشارة الطبيب قبل استخدامه، خاصة لمن يعانون من مشاكل في الكلى.  
        `, 
        dest: `
        1. يحتوي على **داباجليفلوزين** الذي يساعد في التخلص من الجلوكوز عن طريق البول.  
        2. يحتوي على **ميتفورمين** الذي يقلل إنتاج الجلوكوز في الكبد ويحسن استجابة الجسم للإنسولين.  
        3. يُستخدم في شكل أقراص ممتدة المفعول مرة واحدة يوميًا.  
        4. غير مناسب لمرضى السكري من النوع الأول أو المصابين بحماض كيتوني سكري.  
        `,  
        image: "../image3/xlgduo.jpg", 
        price: 3200,
    },
    { 
        name: "غير معروف", 
        description: `هذا المنتج لم يتم تحديده بعد، وقد يكون دواءً جديدًا أو منتجًا غير معروف اسمه التجاري. يُوصى بعدم استخدام أي دواء دون التأكد من مكوناته وآثاره المحتملة. للحصول على معلومات دقيقة، يُفضل التواصل مع الجهة المصنعة أو الصيدلية المختصة. يُنصح بقراءة النشرة الداخلية والتأكد من مطابقة المنتج لمواصفات السلامة والجودة. يمكن مراجعة الطبيب أو الصيدلي للحصول على المعلومات اللازمة حول هذا المنتج.`,
        specifications: `
        1. لم يتم تحديد المواصفات الدقيقة لهذا المنتج بعد.  
        2. يُرجى التأكد من مصدر الدواء قبل الاستخدام.  
        3. يُوصى بعدم استخدام أي دواء دون التأكد من مكوناته وتأثيراته الجانبية.  
        4. يُفضل استشارة الطبيب أو الصيدلي لمعرفة مزيد من التفاصيل.  
        5. يُرجى التواصل مع الجهة المسؤولة للحصول على معلومات رسمية حول هذا المنتج.  
        `, 
        dest: `
        1. لم يتم تحديد التركيبة الدوائية لهذا المنتج.  
        2. يُوصى بعدم استخدامه إلا بعد التأكد من مكوناته وآثاره المحتملة.  
        3. للحصول على معلومات دقيقة، يُفضل التواصل مع الشركة المصنعة أو الصيدلية المختصة.  
        4. يُنصح بقراءة النشرة الداخلية والتأكد من مطابقة المنتج لمواصفات السلامة والجودة.  
        `,  
        image: "../image3/IMG-20250327-WA0018.jpg", 
        price: 3200,
    },
    
    { 
        name: "", 
        description: ``, 
        specifications: ` `, 
        dest: ``,  
        image: "../image3/IMG-20250327-WA0019.jpg", 
        price: 3200,
    },
    { 
        name: "", 
        description: ``, 
        specifications: ` `, 
        dest: ``,  
        image: "../image3/glucophage2.jpg", 
        price: 3200,
    },
    { 
        name: "", 
        description: ``, 
        specifications: ` `, 
        dest: ``,  
        image: "../image3/sevikar.jpg", 
        price: 3200,
    },
    { 
        name: "", 
        description: ``, 
        specifications: ` `, 
        dest: ``,  
        image: "../image3/captopril.jpg", 
        price: 3200,
    },
    { 
        name: "", 
        description: ``, 
        specifications: ` `, 
        dest: ``,  
        image: "../image3/amlo5.jpg", 
        price: 3200,
    },
    
];
 
    
    function displayProducts() {
        let container = document.getElementById("products-list");
        container.innerHTML = "";
    
        products.forEach(product => {
            let div = document.createElement("div");
            div.classList.add("product-card");
            div.innerHTML = `
                <img src="${product.image}" alt="${product.name}">
                <h3>${product.name}</h3>
                <p>${product.price} جنيه</p>
                <button class="details-button" onclick="viewDetails(${JSON.stringify(product).replace(/"/g, '&quot;')})">
                    عرض التفاصيل
                </button>
            `;
            container.appendChild(div);
        });
    }
    
    function viewDetails(product) {
        localStorage.setItem("selectedProduct", JSON.stringify(product));
        window.location.href = "../html/details.html";
    }
    
    window.onload = displayProducts;
    



    const toggleButton = document.getElementById("dark-mode-toggle");
toggleButton.addEventListener("click", () => {
  document.body.classList.toggle("dark");
});